Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/prod-ue2-sharedservices.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-sharedservices.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.s3_list_and_get_policy must be replaced
-/+ resource "aws_iam_policy" "s3_list_and_get_policy" {
      ~ arn              = "arn:aws:iam::481665084477:policy/anime_s3_list_and_get_policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "Policy to allow Lambda to list the bucket and get objects" -> "Policy to allow Lambda full access to S3 for the prod-animeutopia-media-bucket" # forces replacement
      ~ id               = "arn:aws:iam::481665084477:policy/anime_s3_list_and_get_policy" -> (known after apply)
      ~ name             = "anime_s3_list_and_get_policy" -> "anime_s3_full_policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:ListBucket",
                        ] -> "s3:*"
                      ~ Resource = "arn:aws:s3:::prod-animeutopia-media-bucket" -> [
                          + "arn:aws:s3:::prod-animeutopia-media-bucket",
                          + "arn:aws:s3:::prod-animeutopia-media-bucket/*",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prod-animeutopia-media-bucket/*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ policy_id        = "ANPAXAJLZ5Q6VXQEOFEOI" -> (known after apply)
      - tags             = {} -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.attach_s3_list_and_get_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_s3_list_and_get_policy" {
      ~ id         = "anime_lambda_role-20250226200348676600000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::481665084477:policy/anime_s3_list_and_get_policy" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.render_video will be updated in-place
~ resource "aws_lambda_function" "render_video" {
        id                             = "render_video"
      ~ last_modified                  = "2025-02-27T16:02:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ynE2BDLHzof9pp4GRqnRgryj3HiAXqG94gMx6iWxXUY=" -> "/RcfdbFkOQBHcXTbnd9+cvY2EojEie3RkiMpWAkpQaY="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedMatrix%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 2 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```